CSI API ETABS v1

# cDesignCompositeColumnResetOverwrites Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int ResetOverwrites()

    Function ResetOverwrites As Integer

    Dim instance As cDesignCompositeColumn
    Dim returnValue As Integer

    returnValue = instance.ResetOverwrites()

    int ResetOverwrites()

    abstract ResetOverwrites : unit -> int

#### Return Value

Type: Int32

See Also

#### Reference

cDesignCompositeColumn Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com